export const quizData = {
  title: "AI Explorer",
  description: "Погрузитесь в мир технологий будущего и проверьте свои знания об Искусственном Интеллекте.",
  questions: [
    {
      question: "Что означает аббревиатура ИИ?",
      options: ["Интеллектуальный Интерфейс", "Искусственный Интеллект", "Интуитивный Интерфейс"],
      correct: 1
    },
    {
      question: "Как называется тест на проверку 'разумности' машины?",
      options: ["Тест Тьюринга", "Тест Ампера", "Тест Эйнштейна"],
      correct: 0
    },
    {
      question: "В каком году машина впервые победила чемпиона мира по шахматам?",
      options: ["1985 год", "1997 год", "2005 год"],
      correct: 1
    },
    {
      question: "Как зовут первого в мире робота, получившего гражданство?",
      options: ["Алекса", "София", "Алиса"],
      correct: 1
    },
    {
      question: "Какая нейросеть генерирует реалистичные изображения по тексту?",
      options: ["ChatGPT", "Midjourney", "Excel"],
      correct: 1
    },
    {
      question: "Что такое 'обучение с подкреплением'?",
      options: ["Метод обучения за вознаграждение", "Физическая тренировка роботов", "Чтение учебников машиной"],
      correct: 0
    },
    {
      question: "Как называлась первая нейросеть, созданная в 1957 году?",
      options: ["Перцептрон", "Терминатор", "Скайнет"],
      correct: 0
    },
    {
      question: "Какой язык программирования самый популярный для ИИ?",
      options: ["C++", "Java", "Python"],
      correct: 2
    },
    {
      question: "Правда ли, что ИИ может писать музыку и картины?",
      options: ["Да, это уже происходит", "Нет, это невозможно", "Только если робот умеет держать кисть"],
      correct: 0
    },
    {
      question: "Что в ИИ называют 'Галлюцинацией'?",
      options: ["Поломку видеокарты", "Когда ИИ уверенно выдает ложную информацию", "Сны робота"],
      correct: 1
    },
    {
      question: "Какая компания создала знаменитый ChatGPT?",
      options: ["Google", "Microsoft", "OpenAI"],
      correct: 2
    },
    {
      question: "В какой настольной игре ИИ победил лучшего игрока мира?",
      options: ["Шашки", "Го", "Монополия"],
      correct: 1
    },
    {
      question: "Что такое 'Беспилотный автомобиль'?",
      options: ["Машина без мотора", "Машина под управлением ИИ", "Автомобиль на пульте управления"],
      correct: 1
    },
    {
      question: "Как называется область ИИ по пониманию человеческой речи?",
      options: ["NLP (Обработка естественного языка)", "CPU (Процессор)", "VPN (Сети)"],
      correct: 0
    },
    {
      question: "Может ли современный ИИ испытывать настоящие эмоции?",
      options: ["Да, они чувствуют", "Нет, это лишь имитация", "Только если их обидеть"],
      correct: 1
    }
  ]
};